[Killed] BlockStatement
src/budgets/budgets.service.ts:18:55
     private readonly transactionDao: TransactionDao,
   ) {}
 
-  async getBudgets(userId: string): Promise<Budget[]> {
-    const budgets = await this.budgetDao.getBudgetsByUserId(userId);
-    const transactions =
-      await this.transactionDao.getTransactionsByUserId(userId);
-
-    return budgets.map((budget) => {
-      const spent = transactions
-        .filter(
-          (txn) =>
-            txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
-            new Date(txn.date) <= new Date(budget.endDate),
-        )
-        .reduce((sum, txn) => sum + txn.amount, 0);
-
-      return { ...budget, spent };
-    });
-  }
+  async getBudgets(userId: string): Promise<Budget[]> {}
 
   async getBudget(id: string, userId: string): Promise<Budget | null> {
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:3060) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:23:36
     const transactions =
       await this.transactionDao.getTransactionsByUserId(userId);
 
-    return budgets.map((budget) => {
-      const spent = transactions
-        .filter(
-          (txn) =>
-            txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
-            new Date(txn.date) <= new Date(budget.endDate),
-        )
-        .reduce((sum, txn) => sum + txn.amount, 0);
-
-      return { ...budget, spent };
-    });
+    return budgets.map((budget) => {});
   }
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:25288) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] MethodExpression
src/budgets/budgets.service.ts:24:21
       await this.transactionDao.getTransactionsByUserId(userId);
 
     return budgets.map((budget) => {
-      const spent = transactions
-        .filter(
-          (txn) =>
-            txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
-            new Date(txn.date) <= new Date(budget.endDate),
-        )
+      const spent = transactions
         .reduce((sum, txn) => sum + txn.amount, 0);
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:19736) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ArrowFunction
src/budgets/budgets.service.ts:26:11
     return budgets.map((budget) => {
       const spent = transactions
         .filter(
-          (txn) =>
-            txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
-            new Date(txn.date) <= new Date(budget.endDate),
+          () => undefined,
         )
         .reduce((sum, txn) => sum + txn.amount, 0);
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:8048) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] LogicalOperator
src/budgets/budgets.service.ts:27:13
       const spent = transactions
         .filter(
           (txn) =>
-            txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
+            txn.type === TransactionType.EXPENSE && txn.category === budget.category || new Date(txn.date) >= new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
         )
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:20272) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:27:13
       const spent = transactions
         .filter(
           (txn) =>
-            txn.type === TransactionType.EXPENSE &&
+            txn.type !== TransactionType.EXPENSE &&
             txn.category === budget.category &&
             new Date(txn.date) >= new Date(budget.startDate) &&
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:29404) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:28:13
         .filter(
           (txn) =>
             txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
+            txn.category !== budget.category &&
             new Date(txn.date) >= new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:19308) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts (5.585 s)

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:28:13
         .filter(
           (txn) =>
             txn.type === TransactionType.EXPENSE &&
-            txn.category === budget.category &&
+            true &&
             new Date(txn.date) >= new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:2500) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:29:13
           (txn) =>
             txn.type === TransactionType.EXPENSE &&
             txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
+            new Date(txn.date) < new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
         )
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:30172) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:29:13
           (txn) =>
             txn.type === TransactionType.EXPENSE &&
             txn.category === budget.category &&
-            new Date(txn.date) >= new Date(budget.startDate) &&
+            new Date(txn.date) > new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
         )
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:37208) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:30:13
             txn.type === TransactionType.EXPENSE &&
             txn.category === budget.category &&
             new Date(txn.date) >= new Date(budget.startDate) &&
-            new Date(txn.date) <= new Date(budget.endDate),
+            true,
         )
         .reduce((sum, txn) => sum + txn.amount, 0);
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:29868) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:30:13
             txn.type === TransactionType.EXPENSE &&
             txn.category === budget.category &&
             new Date(txn.date) >= new Date(budget.startDate) &&
-            new Date(txn.date) <= new Date(budget.endDate),
+            new Date(txn.date) < new Date(budget.endDate),
         )
         .reduce((sum, txn) => sum + txn.amount, 0);
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:34532) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ArrowFunction
src/budgets/budgets.service.ts:32:17
             new Date(txn.date) >= new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
         )
-        .reduce((sum, txn) => sum + txn.amount, 0);
+        .reduce(() => undefined, 0);
 
       return { ...budget, spent };
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:34504) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ArithmeticOperator
src/budgets/budgets.service.ts:32:31
             new Date(txn.date) >= new Date(budget.startDate) &&
             new Date(txn.date) <= new Date(budget.endDate),
         )
-        .reduce((sum, txn) => sum + txn.amount, 0);
+        .reduce((sum, txn) => sum - txn.amount, 0);
 
       return { ...budget, spent };
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:34924) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:38:71
     });
   }
 
-  async getBudget(id: string, userId: string): Promise<Budget | null> {
-    const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
-      return null;
-    }
-
-    const transactions =
-      await this.transactionDao.getTransactionsByUserId(userId);
-    const spent = transactions
-      .filter(
-        (txn) =>
-          txn.type === TransactionType.EXPENSE &&
-          txn.category === budget.category &&
-          new Date(txn.date) >= new Date(budget.startDate) &&
-          new Date(txn.date) <= new Date(budget.endDate),
-      )
-      .reduce((sum, txn) => sum + txn.amount, 0);
-
-    return { ...budget, spent };
-  }
+  async getBudget(id: string, userId: string): Promise<Budget | null> {}
 
   async createBudget(
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:29324) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:40:20
 
   async getBudget(id: string, userId: string): Promise<Budget | null> {
     const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
+    if (!budget || false) {
       return null;
     }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:1004) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:40:9
 
   async getBudget(id: string, userId: string): Promise<Budget | null> {
     const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
+    if (true) {
       return null;
     }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:21040) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] MethodExpression
src/budgets/budgets.service.ts:46:19
 
     const transactions =
       await this.transactionDao.getTransactionsByUserId(userId);
-    const spent = transactions
-      .filter(
-        (txn) =>
-          txn.type === TransactionType.EXPENSE &&
-          txn.category === budget.category &&
-          new Date(txn.date) >= new Date(budget.startDate) &&
-          new Date(txn.date) <= new Date(budget.endDate),
-      )
+    const spent = transactions
       .reduce((sum, txn) => sum + txn.amount, 0);
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:6192) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] LogicalOperator
src/budgets/budgets.service.ts:49:11
     const spent = transactions
       .filter(
         (txn) =>
-          txn.type === TransactionType.EXPENSE &&
-          txn.category === budget.category &&
-          new Date(txn.date) >= new Date(budget.startDate) &&
-          new Date(txn.date) <= new Date(budget.endDate),
+          txn.type === TransactionType.EXPENSE && txn.category === budget.category && new Date(txn.date) >= new Date(budget.startDate) || new Date(txn.date) <= new Date(budget.endDate),
       )
       .reduce((sum, txn) => sum + txn.amount, 0);
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:33340) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:62:22
   async createBudget(
     userId: string,
     createBudgetDto: CreateBudgetDto,
-  ): Promise<Budget> {
-    const newBudget: Budget = {
-      id: `budget-${Date.now()}`,
-      userId,
-      ...createBudgetDto,
-      startDate: new Date(createBudgetDto.startDate),
-      endDate: new Date(createBudgetDto.endDate),
-      spent: 0,
-      createdAt: new Date(),
-      updatedAt: new Date(),
-    };
-
-    return await this.budgetDao.addBudget(newBudget);
-  }
+  ): Promise<Budget> {}
 
   async updateBudget(
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:12528) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:81:29
     id: string,
     userId: string,
     updateBudgetDto: UpdateBudgetDto,
-  ): Promise<Budget | null> {
-    const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
-      return null;
-    }
-
-    const updates: Partial<Budget> = {};
-    if (updateBudgetDto.category !== undefined)
-      updates.category = updateBudgetDto.category;
-    if (updateBudgetDto.amount !== undefined)
-      updates.amount = updateBudgetDto.amount;
-    if (updateBudgetDto.period !== undefined)
-      updates.period = updateBudgetDto.period;
-    if (updateBudgetDto.startDate !== undefined)
-      updates.startDate = new Date(updateBudgetDto.startDate);
-    if (updateBudgetDto.endDate !== undefined)
-      updates.endDate = new Date(updateBudgetDto.endDate);
-
-    const updated = await this.budgetDao.updateBudget(id, updates);
-    return updated ?? null;
-  }
+  ): Promise<Budget | null> {}
 
   async deleteBudget(id: string, userId: string): Promise<boolean> {
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:4124) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:83:46
     updateBudgetDto: UpdateBudgetDto,
   ): Promise<Budget | null> {
     const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
-      return null;
-    }
+    if (!budget || budget.userId !== userId) {}
 
     const updates: Partial<Budget> = {};
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:4744) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:88:9
     }
 
     const updates: Partial<Budget> = {};
-    if (updateBudgetDto.category !== undefined)
+    if (updateBudgetDto.category === undefined)
       updates.category = updateBudgetDto.category;
     if (updateBudgetDto.amount !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:5672) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:88:9
     }
 
     const updates: Partial<Budget> = {};
-    if (updateBudgetDto.category !== undefined)
+    if (false)
       updates.category = updateBudgetDto.category;
     if (updateBudgetDto.amount !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:12256) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:90:9
     const updates: Partial<Budget> = {};
     if (updateBudgetDto.category !== undefined)
       updates.category = updateBudgetDto.category;
-    if (updateBudgetDto.amount !== undefined)
+    if (false)
       updates.amount = updateBudgetDto.amount;
     if (updateBudgetDto.period !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:22868) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:90:9
     const updates: Partial<Budget> = {};
     if (updateBudgetDto.category !== undefined)
       updates.category = updateBudgetDto.category;
-    if (updateBudgetDto.amount !== undefined)
+    if (true)
       updates.amount = updateBudgetDto.amount;
     if (updateBudgetDto.period !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:37836) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:92:9
       updates.category = updateBudgetDto.category;
     if (updateBudgetDto.amount !== undefined)
       updates.amount = updateBudgetDto.amount;
-    if (updateBudgetDto.period !== undefined)
+    if (true)
       updates.period = updateBudgetDto.period;
     if (updateBudgetDto.startDate !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:30612) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] EqualityOperator
src/budgets/budgets.service.ts:92:9
       updates.category = updateBudgetDto.category;
     if (updateBudgetDto.amount !== undefined)
       updates.amount = updateBudgetDto.amount;
-    if (updateBudgetDto.period !== undefined)
+    if (updateBudgetDto.period === undefined)
       updates.period = updateBudgetDto.period;
     if (updateBudgetDto.startDate !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:12232) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:94:9
       updates.amount = updateBudgetDto.amount;
     if (updateBudgetDto.period !== undefined)
       updates.period = updateBudgetDto.period;
-    if (updateBudgetDto.startDate !== undefined)
+    if (true)
       updates.startDate = new Date(updateBudgetDto.startDate);
     if (updateBudgetDto.endDate !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:34940) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:94:9
       updates.amount = updateBudgetDto.amount;
     if (updateBudgetDto.period !== undefined)
       updates.period = updateBudgetDto.period;
-    if (updateBudgetDto.startDate !== undefined)
+    if (false)
       updates.startDate = new Date(updateBudgetDto.startDate);
     if (updateBudgetDto.endDate !== undefined)
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:21484) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:96:9
       updates.period = updateBudgetDto.period;
     if (updateBudgetDto.startDate !== undefined)
       updates.startDate = new Date(updateBudgetDto.startDate);
-    if (updateBudgetDto.endDate !== undefined)
+    if (true)
       updates.endDate = new Date(updateBudgetDto.endDate);
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:24972) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.service.ts:96:9
       updates.period = updateBudgetDto.period;
     if (updateBudgetDto.startDate !== undefined)
       updates.startDate = new Date(updateBudgetDto.startDate);
-    if (updateBudgetDto.endDate !== undefined)
+    if (false)
       updates.endDate = new Date(updateBudgetDto.endDate);
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:35380) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] LogicalOperator
src/budgets/budgets.service.ts:100:12
       updates.endDate = new Date(updateBudgetDto.endDate);
 
     const updated = await this.budgetDao.updateBudget(id, updates);
-    return updated ?? null;
+    return updated && null;
   }
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:29724) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:103:68
     return updated ?? null;
   }
 
-  async deleteBudget(id: string, userId: string): Promise<boolean> {
-    const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
-      return false;
-    }
-    return await this.budgetDao.deleteBudget(id);
-  }
+  async deleteBudget(id: string, userId: string): Promise<boolean> {}
 }
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:4760) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.service.ts:105:46
 
   async deleteBudget(id: string, userId: string): Promise<boolean> {
     const budget = await this.budgetDao.getBudgetById(id);
-    if (!budget || budget.userId !== userId) {
-      return false;
-    }
+    if (!budget || budget.userId !== userId) {}
     return await this.budgetDao.deleteBudget(id);
   }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:4584) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BooleanLiteral
src/budgets/budgets.service.ts:106:14
   async deleteBudget(id: string, userId: string): Promise<boolean> {
     const budget = await this.budgetDao.getBudgetById(id);
     if (!budget || budget.userId !== userId) {
-      return false;
+      return true;
     }
     return await this.budgetDao.deleteBudget(id);
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:21040) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts
