[Killed] BlockStatement
src/budgets/budgets.controller.ts:23:24
   @Get()
   async getBudgets(
     @Headers('authorization') authorization: string,
-  ): Promise<Budget[]> {
-    const userId = this.extractUserId(authorization);
-    return this.budgetsService.getBudgets(userId);
-  }
+  ): Promise<Budget[]> {}
 
   @Get(':id')
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:11200) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:32:22
   async getBudget(
     @Headers('authorization') authorization: string,
     @Param('id') id: string,
-  ): Promise<Budget> {
-    const userId = this.extractUserId(authorization);
-    const budget = await this.budgetsService.getBudget(id, userId);
-
-    if (!budget) {
-      throw new HttpException('Budget not found', HttpStatus.NOT_FOUND);
-    }
-
-    return budget;
-  }
+  ): Promise<Budget> {}
 
   @Post()
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:12004) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:36:18
     const userId = this.extractUserId(authorization);
     const budget = await this.budgetsService.getBudget(id, userId);
 
-    if (!budget) {
-      throw new HttpException('Budget not found', HttpStatus.NOT_FOUND);
-    }
+    if (!budget) {}
 
     return budget;
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:10772) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BooleanLiteral
src/budgets/budgets.controller.ts:36:9
     const userId = this.extractUserId(authorization);
     const budget = await this.budgetsService.getBudget(id, userId);
 
-    if (!budget) {
+    if (budget) {
       throw new HttpException('Budget not found', HttpStatus.NOT_FOUND);
     }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:29132) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:47:22
   async createBudget(
     @Headers('authorization') authorization: string,
     @Body() createBudgetDto: CreateBudgetDto,
-  ): Promise<Budget> {
-    const userId = this.extractUserId(authorization);
-    return this.budgetsService.createBudget(userId, createBudgetDto);
-  }
+  ): Promise<Budget> {}
 
   @Put(':id')
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:21280) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:57:22
     @Headers('authorization') authorization: string,
     @Param('id') id: string,
     @Body() updateBudgetDto: UpdateBudgetDto,
-  ): Promise<Budget> {
-    const userId = this.extractUserId(authorization);
-    const budget = await this.budgetsService.updateBudget(
-      id,
-      userId,
-      updateBudgetDto,
-    );
-
-    if (!budget) {
-      throw new HttpException('Budget not found', HttpStatus.NOT_FOUND);
-    }
-
-    return budget;
-  }
+  ): Promise<Budget> {}
 
   @Delete(':id')
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:16204) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:76:35
   async deleteBudget(
     @Headers('authorization') authorization: string,
     @Param('id') id: string,
-  ): Promise<{ message: string }> {
-    const userId = this.extractUserId(authorization);
-    const deleted = await this.budgetsService.deleteBudget(id, userId);
-
-    if (!deleted) {
-      throw new HttpException('Budget not found', HttpStatus.NOT_FOUND);
-    }
-
-    return { message: 'Budget deleted successfully' };
-  }
+  ): Promise<{ message: string }> {}
 
   private extractUserId(authorization: string): string {
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:27656) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts (5.364 s)

[Killed] BlockStatement
src/budgets/budgets.controller.ts:80:19
     const userId = this.extractUserId(authorization);
     const deleted = await this.budgetsService.deleteBudget(id, userId);
 
-    if (!deleted) {
-      throw new HttpException('Budget not found', HttpStatus.NOT_FOUND);
-    }
+    if (!deleted) {}
 
     return { message: 'Budget deleted successfully' };
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:10700) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:87:56
     return { message: 'Budget deleted successfully' };
   }
 
-  private extractUserId(authorization: string): string {
-    if (!authorization) {
-      throw new HttpException('Unauthorized', HttpStatus.UNAUTHORIZED);
-    }
-
-    const token = authorization.replace('Bearer ', '');
-    if (!token) {
-      throw new HttpException('Invalid token', HttpStatus.UNAUTHORIZED);
-    }
-
-    return token;
-  }
+  private extractUserId(authorization: string): string {}
 }
 
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:11076) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BlockStatement
src/budgets/budgets.controller.ts:88:25
   }
 
   private extractUserId(authorization: string): string {
-    if (!authorization) {
-      throw new HttpException('Unauthorized', HttpStatus.UNAUTHORIZED);
-    }
+    if (!authorization) {}
 
     const token = authorization.replace('Bearer ', '');
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:13648) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.controller.ts:88:9
   }
 
   private extractUserId(authorization: string): string {
-    if (!authorization) {
+    if (false) {
       throw new HttpException('Unauthorized', HttpStatus.UNAUTHORIZED);
     }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:30340) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] BooleanLiteral
src/budgets/budgets.controller.ts:93:9
     }
 
     const token = authorization.replace('Bearer ', '');
-    if (!token) {
+    if (token) {
       throw new HttpException('Invalid token', HttpStatus.UNAUTHORIZED);
     }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:37580) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts

[Killed] ConditionalExpression
src/budgets/budgets.controller.ts:93:9
     }
 
     const token = authorization.replace('Bearer ', '');
-    if (!token) {
+    if (false) {
       throw new HttpException('Invalid token', HttpStatus.UNAUTHORIZED);
     }
killedBy: All tests
statusReason: > backend@0.0.1 test C:\Users\Софія\Desktop\finance-manager\backend\.stryker-tmp\sandbox-kaIYo7
> jest


(node:1440) ExperimentalWarning: Type Stripping is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/app.controller.spec.ts
