[Survived] BlockStatement
src/services/api.ts:28:17
 class ApiClient {
   private token: string | null = null;
 
-  constructor() {
-    // Load token from localStorage
-    this.token = localStorage.getItem('authToken');
-  }
+  constructor() {}
 
   private getHeaders(): HeadersInit {

[Killed] BlockStatement
src/services/api.ts:33:37
     this.token = localStorage.getItem('authToken');
   }
 
-  private getHeaders(): HeadersInit {
-    const headers: HeadersInit = {
-      'Content-Type': 'application/json',
-    };
-
-    if (this.token) {
-      headers['Authorization'] = `Bearer ${this.token}`;
-    }
-
-    return headers;
-  }
+  private getHeaders(): HeadersInit {}
 
   private async request<T>(
killedBy: ApiClient Authentication Methods should login successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/login",
  Object {
    "body": "{\"email\":\"test@example.com\",\"password\":\"password123\"}",

[Killed] ObjectLiteral
src/services/api.ts:34:34
   }
 
   private getHeaders(): HeadersInit {
-    const headers: HeadersInit = {
-      'Content-Type': 'application/json',
-    };
+    const headers: HeadersInit = {};
 
     if (this.token) {
killedBy: ApiClient Authentication Methods should login successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/login",
  Object {
    "body": "{\"email\":\"test@example.com\",\"password\":\"password123\"}",

[Killed] ConditionalExpression
src/services/api.ts:38:9
       'Content-Type': 'application/json',
     };
 
-    if (this.token) {
+    if (true) {
       headers['Authorization'] = `Bearer ${this.token}`;
     }
killedBy: ApiClient Authentication Methods should login successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/login",
  Object {
    "body": "{\"email\":\"test@example.com\",\"password\":\"password123\"}",

[Killed] BlockStatement
src/services/api.ts:38:21
       'Content-Type': 'application/json',
     };
 
-    if (this.token) {
-      headers['Authorization'] = `Bearer ${this.token}`;
-    }
+    if (this.token) {}
 
     return headers;
killedBy: ApiClient Authentication Methods should logout and clear token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/logout",
  Object {
    "body": "{}",

[Killed] BlockStatement
src/services/api.ts:48:17
   private async request<T>(
     endpoint: string,
     options: RequestInit = {},
-  ): Promise<T> {
-    const response = await fetch(`${API_BASE_URL}${endpoint}`, {
-      ...options,
-      headers: {
-        ...this.getHeaders(),
-        ...options.headers,
-      },
-    });
-
-    if (!response.ok) {
-      const error = await response.json().catch(() => ({
-        message: 'An error occurred',
-      }));
-      throw new Error(
-        error.message || `HTTP error! status: ${response.status}`,
-      );
-    }
-
-    return response.json();
-  }
+  ): Promise<T> {}
 
   // Auth methods
killedBy: ApiClient Authentication Methods should login successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'token')

[Killed] ArrowFunction
src/services/api.ts:58:49
     });
 
     if (!response.ok) {
-      const error = await response.json().catch(() => ({
-        message: 'An error occurred',
-      }));
+      const error = await response.json().catch(() => undefined);
       throw new Error(
         error.message || `HTTP error! status: ${response.status}`,
killedBy: ApiClient Error Handling should handle invalid JSON response
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "An error occurred"
Received message:   "Cannot read properties of undefined (reading 'message')"

       98 |             message: 'An error occurred'
       99 |           })));
    > 100 |           throw new Error(stryMutAct_9fa48("25") ? error.message && `HTTP error! status: ${response.status}` : stryMutAct_9fa48("24") ? f

[Killed] ObjectLiteral
src/services/api.ts:58:56
     });
 
     if (!response.ok) {
-      const error = await response.json().catch(() => ({
-        message: 'An error occurred',
-      }));
+      const error = await response.json().catch(() => ({}));
       throw new Error(
         error.message || `HTTP error! status: ${response.status}`,
killedBy: ApiClient Error Handling should handle invalid JSON response
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "An error occurred"
Received message:   "HTTP error! status: 500"

       98 |             message: 'An error occurred'
       99 |           })));
    > 100 |           throw new Error(stryMutAct_9fa48("25") ? error.message && `HTTP error! status: ${response.status}` : stryMutAct_9fa48("24") ? false : stryMutAct_9fa48("23") ?

[Killed] ConditionalExpression
src/services/api.ts:62:9
         message: 'An error occurred',
       }));
       throw new Error(
-        error.message || `HTTP error! status: ${response.status}`,
+        false,
       );
     }
killedBy: ApiClient Error Handling should throw error on failed request
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unauthorized"
Received message:   "false"

       98 |             message: 'An error occurred'
       99 |           })));
    > 100 |           throw new Error(stryMutAct_9fa48("25") ? error.message && `HTTP error! status: ${response.status}` : stryMutAct_9fa48("24") ? false : stryMutAct_9fa48("23") ? true : (stryCov_9fa48("

[Killed] LogicalOperator
src/services/api.ts:62:9
         message: 'An error occurred',
       }));
       throw new Error(
-        error.message || `HTTP error! status: ${response.status}`,
+        error.message && `HTTP error! status: ${response.status}`,
       );
     }
killedBy: ApiClient Error Handling should throw error on failed request
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Unauthorized"
Received message:   "HTTP error! status: 401"

       98 |             message: 'An error occurred'
       99 |           })));
    > 100 |           throw new Error(stryMutAct_9fa48("25") ? error.message && `HTTP error! status: ${response.status}` : stryMutAct_9fa48("24") ? false : stryMutAct_9fa48("23") ? true

[Killed] BlockStatement
src/services/api.ts:70:60
   }
 
   // Auth methods
-  async register(data: RegisterDto): Promise<AuthResponse> {
-    const response = await this.request<AuthResponse>('/auth/register', {
-      method: 'POST',
-      body: JSON.stringify(data),
-    });
-    this.setToken(response.token);
-    return response;
-  }
+  async register(data: RegisterDto): Promise<AuthResponse> {}
 
   async login(data: LoginDto): Promise<AuthResponse> {
killedBy: ApiClient Authentication Methods should register successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/auth/register", {"body": "{\"email\":\"new@example.com\",\"password\":\"password123\",\"name\":\"New User\"}", "headers": {"Content-Type": "application/json"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:79:54
     return response;
   }
 
-  async login(data: LoginDto): Promise<AuthResponse> {
-    const response = await this.request<AuthResponse>('/auth/login', {
-      method: 'POST',
-      body: JSON.stringify(data),
-    });
-    this.setToken(response.token);
-    return response;
-  }
+  async login(data: LoginDto): Promise<AuthResponse> {}
 
   async logout(): Promise<void> {
killedBy: ApiClient Authentication Methods should login successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/auth/login", {"body": "{\"email\":\"test@example.com\",\"password\":\"password123\"}", "headers": {"Content-Type": "application/json"}, "method": "POST"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:80:70
   }
 
   async login(data: LoginDto): Promise<AuthResponse> {
-    const response = await this.request<AuthResponse>('/auth/login', {
-      method: 'POST',
-      body: JSON.stringify(data),
-    });
+    const response = await this.request<AuthResponse>('/auth/login', {});
     this.setToken(response.token);
     return response;
killedBy: ApiClient Authentication Methods should login successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/login",
  Object {
-   "body": "{\"email\":\"test@example.com\",\"password\":\"password123\"}",

[Killed] BlockStatement
src/services/api.ts:88:33
     return response;
   }
 
-  async logout(): Promise<void> {
-    await this.request('/auth/logout', {
-      method: 'POST',
-      body: JSON.stringify({}),
-    });
-    this.clearToken();
-  }
+  async logout(): Promise<void> {}
 
   async getProfile(): Promise<UserProfile> {
killedBy: ApiClient Authentication Methods should logout and clear token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/auth/logout", {"body": "{}", "headers": {"Authorization": "Bearer existing-token", "Content-Type": "application/json"}, "method": "POST"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:89:40
   }
 
   async logout(): Promise<void> {
-    await this.request('/auth/logout', {
-      method: 'POST',
-      body: JSON.stringify({}),
-    });
+    await this.request('/auth/logout', {});
     this.clearToken();
   }
killedBy: ApiClient Authentication Methods should logout and clear token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/logout",
  Object {
-   "body": "{}",

[Killed] BlockStatement
src/services/api.ts:96:44
     this.clearToken();
   }
 
-  async getProfile(): Promise<UserProfile> {
-    return this.request<UserProfile>('/auth/profile');
-  }
+  async getProfile(): Promise<UserProfile> {}
 
   async updateProfile(data: UpdateProfileDto): Promise<UserProfile> {
killedBy: ApiClient Authentication Methods should get user profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/auth/profile", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:100:69
     return this.request<UserProfile>('/auth/profile');
   }
 
-  async updateProfile(data: UpdateProfileDto): Promise<UserProfile> {
-    return this.request<UserProfile>('/auth/profile', {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
-  }
+  async updateProfile(data: UpdateProfileDto): Promise<UserProfile> {}
 
   // Transaction methods
killedBy: ApiClient Authentication Methods should update user profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/auth/profile", {"body": "{\"name\":\"Updated User\",\"email\":\"updated@example.com\"}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "PUT"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:101:55
   }
 
   async updateProfile(data: UpdateProfileDto): Promise<UserProfile> {
-    return this.request<UserProfile>('/auth/profile', {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
+    return this.request<UserProfile>('/auth/profile', {});
   }
 
killedBy: ApiClient Authentication Methods should update user profile
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/auth/profile",
  Object {
-   "body": "{\"name\":\"Updated User\",\"email\":\"updated@example.com\"}",

[Killed] BlockStatement
src/services/api.ts:108:79
   }
 
   // Transaction methods
-  async getTransactions(filters?: TransactionFilters): Promise<Transaction[]> {
-    const params = new URLSearchParams();
-    if (filters?.startDate)
-      params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
-      params.append('endDate', filters.endDate.toISOString());
-    if (filters?.category) params.append('category', filters.category);
-    if (filters?.type) params.append('type', filters.type);
-
-    const query = params.toString();
-    return this.request<Transaction[]>(
-      `/transactions${query ? `?${query}` : ''}`,
-    );
-  }
+  async getTransactions(filters?: TransactionFilters): Promise<Transaction[]> {}
 
   async getTransaction(id: string): Promise<Transaction> {
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/transactions", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] ConditionalExpression
src/services/api.ts:110:9
   // Transaction methods
   async getTransactions(filters?: TransactionFilters): Promise<Transaction[]> {
     const params = new URLSearchParams();
-    if (filters?.startDate)
+    if (false)
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
killedBy: ApiClient Transaction Methods should get transactions with filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/transactions?startDate=2024-01-01T00%3A00%3A00.000Z&endDate=2024-01-31T00%3A00%3A00.000Z&category=Food&type=EXPENSE",
+ "/api/transactions?endDate=2024-01-31T00%3A00%3A00.000Z&category=Food&type=EXPENSE",
  {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}},

[Killed] ConditionalExpression
src/services/api.ts:110:9
   // Transaction methods
   async getTransactions(filters?: TransactionFilters): Promise<Transaction[]> {
     const params = new URLSearchParams();
-    if (filters?.startDate)
+    if (true)
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: TypeError: Cannot read properties of undefined (reading 'startDate')

[Killed] ConditionalExpression
src/services/api.ts:112:9
     const params = new URLSearchParams();
     if (filters?.startDate)
       params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
+    if (false)
       params.append('endDate', filters.endDate.toISOString());
     if (filters?.category) params.append('category', filters.category);
killedBy: ApiClient Transaction Methods should get transactions with filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "/api/transactions?startDate=2024-01-01T00%3A00%3A00.000Z&endDate=2024-01-31T00%3A00%3A00.000Z&category=Food&type=EXPENSE",
+ "/api/transactions?startDate=2024-01-01T00%3A00%3A00.000Z&category=Food&type=EXPENSE",
  {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}},

[Killed] ConditionalExpression
src/services/api.ts:112:9
     const params = new URLSearchParams();
     if (filters?.startDate)
       params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
+    if (true)
       params.append('endDate', filters.endDate.toISOString());
     if (filters?.category) params.append('category', filters.category);
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: TypeError: Cannot read properties of undefined (reading 'endDate')

[Killed] OptionalChaining
src/services/api.ts:114:9
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
       params.append('endDate', filters.endDate.toISOString());
-    if (filters?.category) params.append('category', filters.category);
+    if (filters.category) params.append('category', filters.category);
     if (filters?.type) params.append('type', filters.type);
 
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: TypeError: Cannot read properties of undefined (reading 'category')

[Killed] ConditionalExpression
src/services/api.ts:114:9
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
       params.append('endDate', filters.endDate.toISOString());
-    if (filters?.category) params.append('category', filters.category);
+    if (true) params.append('category', filters.category);
     if (filters?.type) params.append('type', filters.type);
 
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: TypeError: Cannot read properties of undefined (reading 'category')

[Killed] ConditionalExpression
src/services/api.ts:115:9
     if (filters?.endDate)
       params.append('endDate', filters.endDate.toISOString());
     if (filters?.category) params.append('category', filters.category);
-    if (filters?.type) params.append('type', filters.type);
+    if (true) params.append('type', filters.type);
 
     const query = params.toString();
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] OptionalChaining
src/services/api.ts:115:9
     if (filters?.endDate)
       params.append('endDate', filters.endDate.toISOString());
     if (filters?.category) params.append('category', filters.category);
-    if (filters?.type) params.append('type', filters.type);
+    if (filters.type) params.append('type', filters.type);
 
     const query = params.toString();
killedBy: ApiClient Transaction Methods should get all transactions
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/services/api.ts:123:58
     );
   }
 
-  async getTransaction(id: string): Promise<Transaction> {
-    return this.request<Transaction>(`/transactions/${id}`);
-  }
+  async getTransaction(id: string): Promise<Transaction> {}
 
   async createTransaction(data: CreateTransactionDto): Promise<Transaction> {
killedBy: ApiClient Transaction Methods should get single transaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/transactions/123", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:127:77
     return this.request<Transaction>(`/transactions/${id}`);
   }
 
-  async createTransaction(data: CreateTransactionDto): Promise<Transaction> {
-    return this.request<Transaction>('/transactions', {
-      method: 'POST',
-      body: JSON.stringify(data),
-    });
-  }
+  async createTransaction(data: CreateTransactionDto): Promise<Transaction> {}
 
   async updateTransaction(
killedBy: ApiClient Transaction Methods should create transaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/transactions", {"body": "{\"type\":\"EXPENSE\",\"amount\":100,\"category\":\"Food\",\"description\":\"Lunch\",\"date\":\"2024-01-15T00:00:00.000Z\"}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:137:27
   async updateTransaction(
     id: string,
     data: UpdateTransactionDto,
-  ): Promise<Transaction> {
-    return this.request<Transaction>(`/transactions/${id}`, {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
-  }
+  ): Promise<Transaction> {}
 
   async deleteTransaction(id: string): Promise<void> {
killedBy: ApiClient Transaction Methods should update transaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/transactions/1", {"body": "{\"amount\":150}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "PUT"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:138:61
     id: string,
     data: UpdateTransactionDto,
   ): Promise<Transaction> {
-    return this.request<Transaction>(`/transactions/${id}`, {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
+    return this.request<Transaction>(`/transactions/${id}`, {});
   }
 
killedBy: ApiClient Transaction Methods should update transaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/transactions/1",
  Object {
-   "body": "{\"amount\":150}",

[Killed] BlockStatement
src/services/api.ts:144:54
     });
   }
 
-  async deleteTransaction(id: string): Promise<void> {
-    await this.request(`/transactions/${id}`, {
-      method: 'DELETE',
-      body: JSON.stringify({}),
-    });
-  }
+  async deleteTransaction(id: string): Promise<void> {}
 
   async getBudgets(): Promise<Budget[]> {
killedBy: ApiClient Transaction Methods should delete transaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/transactions/1", {"body": "{}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "DELETE"}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:151:41
     });
   }
 
-  async getBudgets(): Promise<Budget[]> {
-    return this.request<Budget[]>('/budgets');
-  }
+  async getBudgets(): Promise<Budget[]> {}
 
   async getBudget(id: string): Promise<Budget> {
killedBy: ApiClient Budget Methods should get all budgets
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/budgets", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:155:48
     return this.request<Budget[]>('/budgets');
   }
 
-  async getBudget(id: string): Promise<Budget> {
-    return this.request<Budget>(`/budgets/${id}`);
-  }
+  async getBudget(id: string): Promise<Budget> {}
 
   async createBudget(data: CreateBudgetDto): Promise<Budget> {
killedBy: ApiClient Budget Methods should get single budget
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/budgets/1", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:159:62
     return this.request<Budget>(`/budgets/${id}`);
   }
 
-  async createBudget(data: CreateBudgetDto): Promise<Budget> {
-    return this.request<Budget>('/budgets', {
-      method: 'POST',
-      body: JSON.stringify(data),
-    });
-  }
+  async createBudget(data: CreateBudgetDto): Promise<Budget> {}
 
   async updateBudget(id: string, data: UpdateBudgetDto): Promise<Budget> {
killedBy: ApiClient Budget Methods should create budget
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/budgets", {"body": "{\"category\":\"Food\",\"amount\":500,\"period\":\"MONTHLY\",\"startDate\":\"2024-01-01T00:00:00.000Z\",\"endDate\":\"2024-01-31T00:00:00.000Z\"}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:166:74
     });
   }
 
-  async updateBudget(id: string, data: UpdateBudgetDto): Promise<Budget> {
-    return this.request<Budget>(`/budgets/${id}`, {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
-  }
+  async updateBudget(id: string, data: UpdateBudgetDto): Promise<Budget> {}
 
   async deleteBudget(id: string): Promise<void> {
killedBy: ApiClient Budget Methods should update budget
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/budgets/1", {"body": "{\"amount\":600}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "PUT"}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:173:49
     });
   }
 
-  async deleteBudget(id: string): Promise<void> {
-    // Align with other DELETE calls to avoid body-parser quirks on some setups
-    await this.request(`/budgets/${id}`, {
-      method: 'DELETE',
-      body: JSON.stringify({}),
-    });
-  }
+  async deleteBudget(id: string): Promise<void> {}
 
   // Goal methods
killedBy: ApiClient Budget Methods should delete budget
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/budgets/1", {"body": "{}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "DELETE"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:175:42
 
   async deleteBudget(id: string): Promise<void> {
     // Align with other DELETE calls to avoid body-parser quirks on some setups
-    await this.request(`/budgets/${id}`, {
-      method: 'DELETE',
-      body: JSON.stringify({}),
-    });
+    await this.request(`/budgets/${id}`, {});
   }
 
killedBy: ApiClient Budget Methods should delete budget
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/budgets/1",
  Object {
-   "body": "{}",

[Killed] BlockStatement
src/services/api.ts:182:37
   }
 
   // Goal methods
-  async getGoals(): Promise<Goal[]> {
-    return this.request<Goal[]>('/goals');
-  }
+  async getGoals(): Promise<Goal[]> {}
 
   async getGoal(id: string): Promise<Goal> {
killedBy: ApiClient Goal Methods should get all goals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/goals", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:186:44
     return this.request<Goal[]>('/goals');
   }
 
-  async getGoal(id: string): Promise<Goal> {
-    return this.request<Goal>(`/goals/${id}`);
-  }
+  async getGoal(id: string): Promise<Goal> {}
 
   async createGoal(data: CreateGoalDto): Promise<Goal> {
killedBy: ApiClient Goal Methods should get single goal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/goals/1", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:190:56
     return this.request<Goal>(`/goals/${id}`);
   }
 
-  async createGoal(data: CreateGoalDto): Promise<Goal> {
-    return this.request<Goal>('/goals', {
-      method: 'POST',
-      body: JSON.stringify(data),
-    });
-  }
+  async createGoal(data: CreateGoalDto): Promise<Goal> {}
 
   async updateGoal(id: string, data: UpdateGoalDto): Promise<Goal> {
killedBy: ApiClient Goal Methods should create goal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/goals", {"body": "{\"name\":\"Vacation\",\"targetAmount\":10000,\"deadline\":\"2024-12-31T00:00:00.000Z\"}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "POST"}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:197:68
     });
   }
 
-  async updateGoal(id: string, data: UpdateGoalDto): Promise<Goal> {
-    return this.request<Goal>(`/goals/${id}`, {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
-  }
+  async updateGoal(id: string, data: UpdateGoalDto): Promise<Goal> {}
 
   async deleteGoal(id: string): Promise<void> {
killedBy: ApiClient Goal Methods should update goal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/goals/1", {"body": "{\"currentAmount\":5000}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "PUT"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:198:47
   }
 
   async updateGoal(id: string, data: UpdateGoalDto): Promise<Goal> {
-    return this.request<Goal>(`/goals/${id}`, {
-      method: 'PUT',
-      body: JSON.stringify(data),
-    });
+    return this.request<Goal>(`/goals/${id}`, {});
   }
 
killedBy: ApiClient Goal Methods should update goal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/goals/1",
  Object {
-   "body": "{\"currentAmount\":5000}",

[Killed] BlockStatement
src/services/api.ts:204:47
     });
   }
 
-  async deleteGoal(id: string): Promise<void> {
-    await this.request<void>(`/goals/${id}`, {
-      method: 'DELETE',
-      body: JSON.stringify({}),
-    });
-  }
+  async deleteGoal(id: string): Promise<void> {}
 
   async getDashboard(filters?: {
killedBy: ApiClient Goal Methods should delete goal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/goals/1", {"body": "{}", "headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}, "method": "DELETE"}

Number of calls: 0

[Killed] ObjectLiteral
src/services/api.ts:205:46
   }
 
   async deleteGoal(id: string): Promise<void> {
-    await this.request<void>(`/goals/${id}`, {
-      method: 'DELETE',
-      body: JSON.stringify({}),
-    });
+    await this.request<void>(`/goals/${id}`, {});
   }
 
killedBy: ApiClient Goal Methods should delete goal
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/goals/1",
  Object {
-   "body": "{}",
