[Killed] BlockStatement
src/services/api.ts:214:33
   async getDashboard(filters?: {
     startDate?: Date;
     endDate?: Date;
-  }): Promise<DashboardSummary> {
-    const params = new URLSearchParams();
-    if (filters?.startDate)
-      params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
-      params.append('endDate', filters.endDate.toISOString());
-
-    const query = params.toString();
-    return this.request<DashboardSummary>(
-      `/reports/dashboard${query ? `?${query}` : ''}`,
-    );
-  }
+  }): Promise<DashboardSummary> {}
 
   async getByCategory(
killedBy: ApiClient Report Methods should get dashboard summary
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/reports/dashboard", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:229:33
 
   async getByCategory(
     filters?: TransactionFilters,
-  ): Promise<CategorySummary[]> {
-    const params = new URLSearchParams();
-    if (filters?.startDate)
-      params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
-      params.append('endDate', filters.endDate.toISOString());
-    if (filters?.type) params.append('type', filters.type);
-
-    const query = params.toString();
-    return this.request<CategorySummary[]>(
-      `/reports/by-category${query ? `?${query}` : ''}`,
-    );
-  }
+  ): Promise<CategorySummary[]> {}
 
   async getByPeriod(
killedBy: ApiClient Report Methods should get category summary
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/reports/by-category", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] OptionalChaining
src/services/api.ts:231:9
     filters?: TransactionFilters,
   ): Promise<CategorySummary[]> {
     const params = new URLSearchParams();
-    if (filters?.startDate)
+    if (filters.startDate)
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
killedBy: ApiClient Report Methods should get category summary
statusReason: TypeError: Cannot read properties of undefined (reading 'startDate')

[Killed] OptionalChaining
src/services/api.ts:233:9
     const params = new URLSearchParams();
     if (filters?.startDate)
       params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
+    if (filters.endDate)
       params.append('endDate', filters.endDate.toISOString());
     if (filters?.type) params.append('type', filters.type);
killedBy: ApiClient Report Methods should get category summary
statusReason: TypeError: Cannot read properties of undefined (reading 'endDate')

[Killed] ConditionalExpression
src/services/api.ts:235:9
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
       params.append('endDate', filters.endDate.toISOString());
-    if (filters?.type) params.append('type', filters.type);
+    if (true) params.append('type', filters.type);
 
     const query = params.toString();
killedBy: ApiClient Report Methods should get category summary
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] OptionalChaining
src/services/api.ts:235:9
       params.append('startDate', filters.startDate.toISOString());
     if (filters?.endDate)
       params.append('endDate', filters.endDate.toISOString());
-    if (filters?.type) params.append('type', filters.type);
+    if (filters.type) params.append('type', filters.type);
 
     const query = params.toString();
killedBy: ApiClient Report Methods should get category summary
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/services/api.ts:246:31
   async getByPeriod(
     filters?: { startDate?: Date; endDate?: Date },
     groupBy: 'day' | 'week' | 'month' = 'month',
-  ): Promise<PeriodSummary[]> {
-    const params = new URLSearchParams();
-    if (filters?.startDate)
-      params.append('startDate', filters.startDate.toISOString());
-    if (filters?.endDate)
-      params.append('endDate', filters.endDate.toISOString());
-    params.append('groupBy', groupBy);
-
-    const query = params.toString();
-    return this.request<PeriodSummary[]>(
-      `/reports/by-period${query ? `?${query}` : ''}`,
-    );
-  }
+  ): Promise<PeriodSummary[]> {}
 
   // Categories methods
killedBy: ApiClient Report Methods should get period summary
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/reports/by-period?groupBy=month", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:261:46
   }
 
   // Categories methods
-  async getCategories(): Promise<Category[]> {
-    return this.request<Category[]>('/categories');
-  }
+  async getCategories(): Promise<Category[]> {}
 
   // Token management
killedBy: ApiClient Categories should get categories
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/categories", {"headers": {"Authorization": "Bearer auth-token", "Content-Type": "application/json"}}

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:266:33
   }
 
   // Token management
-  setToken(token: string): void {
-    this.token = token;
-    localStorage.setItem('authToken', token);
-  }
+  setToken(token: string): void {}
 
   clearToken(): void {
killedBy: ApiClient Token Management should set token and store it in localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "authToken", "test-token"

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:271:22
     localStorage.setItem('authToken', token);
   }
 
-  clearToken(): void {
-    this.token = null;
-    localStorage.removeItem('authToken');
-  }
+  clearToken(): void {}
 
   getToken(): string | null {
killedBy: ApiClient Token Management should clear token from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "authToken"

Number of calls: 0

[Killed] BlockStatement
src/services/api.ts:276:29
     localStorage.removeItem('authToken');
   }
 
-  getToken(): string | null {
-    return this.token;
-  }
+  getToken(): string | null {}
 
   isAuthenticated(): boolean {
killedBy: ApiClient Token Management should set token and store it in localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-token"
Received: undefined

[Killed] BlockStatement
src/services/api.ts:280:30
     return this.token;
   }
 
-  isAuthenticated(): boolean {
-    return !!this.token;
-  }
+  isAuthenticated(): boolean {}
 }
 
killedBy: ApiClient Token Management should set token and store it in localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/services/api.ts:281:12
   }
 
   isAuthenticated(): boolean {
-    return !!this.token;
+    return !this.token;
   }
 }
killedBy: ApiClient Token Management should set token and store it in localStorage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
